{nc: 8, depth_multiple: 0.33, width_multiple: 0.25, anchors: [[10, 13, 16, 30, 33,
      23], [30, 61, 62, 45, 59, 119], [116, 90, 156, 198, 373, 326]], backbone: [
    [-1, 1, Conv, [64, 6, 2, 2, 1.0]], [-1, 1, Conv, [128, 3, 2, 1.0]], [-1, 3, C3,
      [128, true, 1, [0.5, 0.5], [1.0, 1.0, 1.0], 0.75]], [-1, 1, Conv, [256, 3, 2,
        0.625]], [-1, 6, C3, [256, true, 1, [0.5, 0.375], [0.5, 0.25, 1.0, 1.0, 1.0,
          1.0], 0.25]], [-1, 1, Conv, [512, 3, 2, 0.3125]], [-1, 9, C3, [512, true,
        1, [0.5, 0.4375], [0.875, 0.625, 0.75, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0], 0.5]],
    [-1, 1, Conv, [1024, 3, 2, 0.71875]], [-1, 3, C3, [1024, true, 1, [0.5, 0.5],
        [1.0, 1.0, 1.0], 0.96875]], [-1, 1, SPPF, [1024, 5, 0.15625]]], head: [[-1,
      1, Conv, [512, 1, 1, 0.5625]], [-1, 1, nn.Upsample, [None, 2, nearest]], [[
        -1, 6], 1, Concat, [1]], [-1, 3, C3, [512, false, 1, [0.5, 0.0625], [0.25,
          1.0, 1.0], 0.3125]], [-1, 1, Conv, [256, 1, 1, 0.125]], [-1, 1, nn.Upsample,
      [None, 2, nearest]], [[-1, 4], 1, Concat, [1]], [-1, 3, C3, [256, false, 1,
        [0.5, 0.125], [0.25, 1.0, 1.0], 1.0]], [-1, 1, Conv, [256, 3, 2, 0.25]], [
      [-1, 14], 1, Concat, [1]], [-1, 3, C3, [512, false, 1, [0.5, 0.0625], [0.125,
          1.0, 1.0], 1.0]], [-1, 1, Conv, [512, 3, 2, 0.5625]], [[-1, 10], 1, Concat,
      [1]], [-1, 3, C3, [1024, false, 1, [0.5, 0.34375], [0.4375, 1.0, 1.0], 0.90625]],
    [[17, 20, 23], 1, Detect, [nc, anchors]]], ch: 3}
