//
// Created by Tarl on 2023-12-30.
//
#include <iostream>
#include "Menu.h"

using namespace std;

void Menu::Init() {
    std::cout << "**************************************\n";
    std::cout << "*   欢迎来到 Tarl 的图书馆书籍管理系统   *\n";
    std::cout << "**************************************\n"
              << "1: 登录" << endl
              << "2: 读者注册" << endl
              << "0: 退出" << endl
              << "-> ";
}

void Menu::AdminMain() {
    cout << "----------------------------------------------------------------"
         << endl
         << "亲爱的图书管理员，请输入对应功能前的编号进行操作" << endl
         << "1: 添加书籍" << endl
         << "2: 查询书籍" << endl
         << "3: 修改书籍信息" << endl
         << "4: 删除书籍" << endl
         << "5: 修改密码" << endl
         << "6: 查看所有用户信息" << endl
         << "0: 退出登录" << endl
         << "-> ";
}

void Menu::GenerMain() {
    cout << "----------------------------------------------------------------"
         << endl
         << "亲爱的读者，请输入对应功能前的编号进行操作" << endl
         << "1: 查询书籍" << endl
         << "2: 查看已借阅书籍" << endl
         << "3: 借阅or归还书籍" << endl
         << "4: 修改密码" << endl
         << "0: 退出登录" << endl
         << "-> ";
}

void Menu::Search() {
    cout << "----------------------------------------------------------------"
         << endl
         << "请输入对应功能前的编号进行操作" << endl
         << "1: 根据书籍编号进行查询" << endl
         << "2: 根据ISBN号进行查询" << endl
         << "3: 根据书籍标题进行查询" << endl
         << "4: 查看所有书籍" << endl
         << "0: 返回上级菜单" << endl
         << "-> ";
}

void Menu::Update() {
    cout << "----------------------------------------------------------------"
         << endl
         << "请输入对应功能前的编号进行操作" << endl
         << "1: 根据书籍编号进行修改" << endl
         << "2: 根据ISBN号进行修改" << endl
         << "3: 根据书籍标题进行修改" << endl
         << "0: 返回上级菜单" << endl
         << "-> ";
}

void Menu::Remove() {
    cout << "----------------------------------------------------------------"
         << endl
         << "请输入对应功能前的编号进行操作" << endl
         << "1: 根据书籍编号进行删除" << endl
         << "2: 根据ISBN号进行删除" << endl
         << "3: 根据书籍标题进行修改" << endl
         << "0: 返回上级菜单" << endl
         << "-> ";
}

void Menu::LendOrReturn() {
    cout << "----------------------------------------------------------------"
         << endl
         << "请输入对应功能前的编号进行操作" << endl
         << "1: 借阅" << endl
         << "2: 归还" << endl
         << "0: 返回上级菜单" << endl
         << "-> ";
}

void Menu::pointer() {
    cout << "\n->";
}

void Menu::reenter() {
    cout << "输入错误！请重新输入！\n";
}



